[14.349225997924805, 7.3299407958984375, "Barracuda warns of Zero-Day vulnerability in Email Security Gateway (ESG)\nThailand Computer Emergency Response Team (ThaiCERT) 280/66 (IT) Friday, May 26, 2023. Barracuda, a provider of email and network security solutions, has issued a warning to customers that a Zero-day vulnerability that can be compromised in Email Security Gateway (ESG) was discovered last week. The vulnerability led to unauthorized access to some Email Gateways devices. On May 19, 2023, Barracuda discovered the vulnerability in Email Security Gateway (ESG) numbered CVE-2023-2868, which could be compromised on some Email Security Gateway (ESG) devices. On May 20, 2023, all ESG devices worldwide were patched for the vulnerability.  Barracuda added that the vulnerability was located in the incoming email attachment screening module. As many organizations, including some prominent ones, use ESG devices, the problem could be widespread. Barracuda stated that this issue will not affect other products or SaaS email security services.  Affected organizations are advised to check their networks to detect systems compromised by attackers. \n https://www.thaicert.or.th/2023/05/26/barracuda-%e0%b9%81%e0%b8%88%e0%b9%89%e0%b8%87%e0%b9%80%e0%b8%95%e0%b8%b7%e0%b8%ad%e0%b8%99%e0%b8%8a%e0%b9%88%e0%b8%ad%e0%b8%87%e0%b9%82%e0%b8%ab%e0%b8%a7%e0%b9%88-zero-day-%e0%b9%83%e0%b8%99-email-se/", "2023", 0]
[16.929765701293945, 7.103519439697266, "European research and development priorities in cybersecurity\nA new  report aims to identify the cybersecurity threats to European society and to identify priorities in research that will lead to mitigations before those cybersecurity threats materialise.\n\nThe proposed research priorities have the aim to make Europe ”a global leader in cybersecurity by 2025, in order to ensure the trust, confidence and protection of our citizens, consumers and enterprises online, and to enable a free and law-governed internet”, as stated at the Tallinn Digital Summit in September 2017.\nBased on desktop research and interviews with experts, the report tries to foresee the European society in the near future, as far as 2025, and the societal changes brought by innovation in the digitally connected world.\nThe report recognises the interdependencies among the digital and physical world, the pervasiveness of connectivity in all aspects of society and industries, the evolution of the technologies and their effect on society.\nThe report focuses on identifying emerging challenges and on those current challenges that are evolving into significant risks to society. Closely related are the challenges in social dynamics, brought about by changes in society that technology has enabled.\nFor the full report:\nAnalysis of the European R&D priorities in cybersecurity https://www.enisa.europa.eu/news/enisa-news/european-research-and-development-priorities-in-cybersecurity", "2018", 0]
[15.2890043258667, 4.417078971862793, "Phishing is techniques, \n\nAdversaries may send malicious content to users in order to gain access to their mobile devices. All forms of phishing are electronically delivered social engineering. Adversaries can conduct both non-targeted phishing, such as in mass malware spam campaigns, as well as more targeted phishing tailored for a specific individual, company, or industry, known as \"spearphishing\".  Phishing often involves social engineering techniques, such as posing as a trusted source, as well as evasion techniques, such as removing or manipulating emails or metadata/headers from compromised accounts being abused to send messages.\nMobile phishing may take various forms. For example, adversaries may send emails containing malicious attachments or links, typically to deliver and then execute malicious code on victim devices. Phishing may also be conducted via third-party services, like social media platforms.  \nMobile devices are a particularly attractive target for adversaries executing phishing campaigns.  Due to their smaller form factor than traditional desktop endpoints, users may not be able to notice minor differences between genuine and phishing websites. Further, mobile devices have additional sensors and radios that allow adversaries to execute phishing attempts over several different vectors, such as: \n https://attack.mitre.org/techniques/T1660", "2023", 1]
[17.454021453857422, 7.518404960632324, "Commissioner Mariya Gabriel visits \nThe Commissioner, today, met with the  Executive Director Professor Dr. Udo Helmbrecht and the staff for a discussion on the current and future role of the Agency in the cybersecurity of Europe.\n\n welcomed, for the first time, the visit of the Commissioner for Digital Economy and Society, Ms. Mariya Gabriel, in the Agency’s premises in Athens.\nThe timing of the visit is particularly opportune in that the Commission published last week a new proposed Draft EU Cybersecurity Act for a permanent and stronger mandate for  as well as a new EU cybersecurity strategy.\nThe meeting provided an opportunity to meet the staff of  and to discuss how the European Commission sees the future role of  and the cybersecurity landscape in Europe.\nOther important issues discussed included a coordinated response between stakeholders to large scale cross border cyber incidents (the Blueprint), cyber exercises as well as cooperation and coordination of cyber activities between the Member States.\nSpeaking at the meeting with the  staff, Commissioner Mariya Gabriel said “I am very happy to see such a young, engaged and committed team working in  to help secure the European cyberspace”.\nThe Executive Director of , Professor Dr. Udo Helmbrecht said “we welcome the opportunity to discuss the proposal of the Commission on the new Cybersecurity Act for a reformed and stronger EU Cybersecurity Agency here in Greece and I would like to thank Commissioner Gabriel for her support. I look forward to the proposed Cybersecurity Act being debated in the Council and the EU Parliament in the next few months.” https://www.enisa.europa.eu/news/enisa-news/commissioner-mariya-gabriel-visits-enisa", "2017", 0]
[14.355218887329102, 4.907021522521973, "Acquire Infrastructure: Botnet is techniques, \n\nAdversaries may buy, lease, or rent a network of compromised systems that can be used during targeting. A botnet is a network of compromised systems that can be instructed to perform coordinated tasks.\n Adversaries may purchase a subscription to use an existing botnet from a booter/stresser service. With a botnet at their disposal, adversaries may perform follow-on activity such as large-scale \n or Distributed Denial of Service (DDoS).\n https://attack.mitre.org/techniques/T1583/005/", "2020", 1]
[17.355621337890625, 8.33174991607666, " opens a new Athens office\nEU cyber security agency  opens the doors to its new branch office in Athens today (01/03/2013).\n\nThe Core Operations Department of the Agency is now located in the new premises, due to their extensive interaction with and frequent travel to the EU Member States. The new office replaces previous facilities in the Markopoulo area of Athens.\n’s seat is in the city of Heraklion, on the Greek island of Crete, where the Executive Director and all the other staff of the Agency continue to work.\nThe  Management Board Member for Greece, Nikos Mourkogiannis declared today:  “I am confident that the opening of ’s office in Athens secures  in Greece.”\nSteve Purser, Head of ’s Core Operations Department, stated: “The move to Athens represents a big step in the development of the Agency and brings with it a host of new opportunities. In particular, travel to and from the Member States will be easier and faster with Athens as a hub.”\n’s Athens office address is:\n1 Vasilissis Sofias\nMaroussi 151 24\nAthens, Greece https://www.enisa.europa.eu/news/enisa-news/enisa-opens-a-new-Athens-office", "2013", 0]
[12.954503059387207, 4.51461124420166, "Device Restart/Shutdown is techniques, \n\nAdversaries may forcibly restart or shutdown a device in an ICS environment to disrupt and potentially negatively impact physical processes. Methods of device restart and shutdown exist in some devices as built-in, standard functionalities. These functionalities can be executed using interactive device web interfaces, CLIs, and network protocol commands.\nUnexpected restart or shutdown of control system devices may prevent expected response functions happening during critical states.\nA device restart can also be a sign of malicious device modifications, as many updates require a shutdown in order to take effect.\n https://attack.mitre.org/techniques/T0816", "2020", 1]
[13.954527854919434, 4.850820064544678, "Automated Exfiltration: Traffic Duplication is techniques, \n\nAdversaries may leverage traffic mirroring in order to automate data exfiltration over compromised infrastructure. Traffic mirroring is a native feature for some devices, often used for network analysis. For example, devices may be configured to forward network traffic to one or more destinations for analysis by a network analyzer or other monitoring device. \nAdversaries may abuse traffic mirroring to mirror or redirect network traffic through other infrastructure they control. Malicious modifications to network devices to enable traffic redirection may be possible through \n or \n.\nMany cloud-based environments also support traffic mirroring. For example, AWS Traffic Mirroring, GCP Packet Mirroring, and Azure vTap allow users to define specified instances to collect traffic from and specified targets to send collected traffic to.\nAdversaries may use traffic duplication in conjunction with \n, \n, or \n depending on the goals and objectives of the adversary.\n https://attack.mitre.org/techniques/T1020/001/", "2020", 1]
[15.098600387573242, 7.281036853790283, "A group of 40 state attorneys general sent a letter to Meta, the parent company of Instagram and Facebook, expressing \"serious concerns\" over a significant increase in consumer complaints regarding account takeovers by malicious actors who change passwords. They urged Meta to improve its preventative measures.  Once malicious actors gain control, they immediately change passwords, locking out legitimate owners. They then post content, access private messages, contact individuals for scams, and engage in other harmful or illegal behavior.  Besides demanding immediate action to improve mitigation strategies and response to affected users, the attorneys general also requested data from Meta on the number of account takeovers in the past five years, suspected causes for the increase, and existing safeguards.\n https://www.thaicert.or.th/2024/03/11/%e0%b8%81%e0%b8%a5%e0%b8%b8%e0%b9%88%e0%b8%a1%e0%b8%ad%e0%b8%b1%e0%b8%a2%e0%b8%81%e0%b8%b2%e0%b8%a3%e0%b8%aa%e0%b8%b9%e0%b8%87%e0%b8%aa%e0%b8%b8%e0%b8%94-40-%e0%b8%a3%e0%b8%b1%e0%b8%90-%e0%b8%aa/", "2024", 0]
[14.651789665222168, 4.3414435386657715, "Compromise Infrastructure: Botnet is techniques, \n\nAdversaries may compromise numerous third-party systems to form a botnet that can be used during targeting. A botnet is a network of compromised systems that can be instructed to perform coordinated tasks.\n Instead of purchasing/renting a botnet from a booter/stresser service, adversaries may build their own botnet by compromising numerous third-party systems.\n Adversaries may also conduct a takeover of an existing botnet, such as redirecting bots to adversary-controlled C2 servers.\n With a botnet at their disposal, adversaries may perform follow-on activity such as large-scale \n or Distributed Denial of Service (DDoS).\n https://attack.mitre.org/techniques/T1584/005/", "2020", 1]
[12.795215606689453, 7.13689661026001, "IMAPLoader is software, \n\n is a .NET-based loader malware exclusively associated with \n operations since at least 2022. \n leverages email protocols for command and control and payload delivery.\n https://attack.mitre.org/software/S1152", "2024", 0]
[13.048233032226562, 7.501554489135742, "C0018 is campaigns, \n\n was a month-long ransomware intrusion that successfully deployed \n onto a compromised network. The unidentified actors gained initial access to the victim network through an exposed server and used a variety of open-source tools prior to executing \n.\n https://attack.mitre.org/campaigns/C0018", "2023", 0]
[14.57532024383545, 5.332891941070557, "Exploit Public-Facing Application is techniques, \n\nAdversaries may attempt to exploit a weakness in an Internet-facing host or system to initially access a network. The weakness in the system can be a software bug, a temporary glitch, or a misconfiguration.\nExploited applications are often websites/web servers, but can also include databases (like SQL), standard services (like SMB or SSH), network device administration and management protocols (like SNMP and Smart Install), and any other system with Internet-accessible open sockets.\n Depending on the flaw being exploited this may also involve \n or \n.\nIf an application is hosted on cloud-based infrastructure and/or is containerized, then exploiting it may lead to compromise of the underlying instance or container. This can allow an adversary a path to access the cloud or container APIs (e.g., via the \n), exploit container host access via \n, or take advantage of weak identity and access management policies.\nAdversaries may also exploit edge network infrastructure and related appliances, specifically targeting devices that do not support robust host-based defenses.\nFor websites and databases, the OWASP top 10 and CWE top 25 highlight the most common web-based vulnerabilities.\n https://attack.mitre.org/techniques/T1190", "2018", 1]
[16.253795623779297, 5.311934947967529, "Improper Verification of Source of a Communication Channel # Description : \nThe product establishes a communication channel to handle an incoming request that has been initiated by an actor, but it does not properly verify that the request is coming from the expected origin.\n\n# Extend Description : \nExtended Description\nWhen an attacker can successfully establish a communication channel from an untrusted origin, the attacker may be able to gain privileges and access unexpected functionality.\n\n# Migration : \nPotential Mitigations\nPhase: Architecture and Design\nUse a mechanism that can validate the identity of the source, such as a certificate, and validate the integrity of data to ensure that it cannot be modified in transit using an Adversary-in-the-Middle (AITM) attack.\nWhen designing functionality of actions in the URL scheme, consider whether the action should be accessible to all mobile applications, or if an allowlist of applications to interface with is appropriate.\n https://cwe.mitre.org/data/definitions/940.html", "2014", 1]
[15.387207984924316, 5.882795810699463, "Use of Persistent Cookies Containing Sensitive Information # Description : \nThe web application uses persistent cookies, but the cookies contain sensitive information.\n\n# Extend Description : \nExtended Description\nCookies are small bits of data that are sent by the web application but stored locally in the browser. This lets the application use the cookie to pass information between pages and store variable information. The web application controls what information is stored in a cookie and how it is used. Typical types of information stored in cookies are session identifiers, personalization and customization information, and in rare cases even usernames to enable automated logins. There are two different types of cookies: session cookies and persistent cookies. Session cookies just live in the browser's memory and are not stored anywhere, but persistent cookies are stored on the browser's hard drive. This can cause security and privacy issues depending on the information stored in the cookie and how it is accessed.\n\n# Migration : \nPotential Mitigations\nPhase: Architecture and Design\nDo not store sensitive information in persistent cookies.\n https://cwe.mitre.org/data/definitions/539.html", "2006", 1]
[13.141278266906738, 4.995633125305176, "Impair Defenses: Indicator Blocking is techniques, \n\nAn adversary may attempt to block indicators or events typically captured by sensors from being gathered and analyzed. This could include maliciously redirecting\n or even disabling host-based sensors, such as Event Tracing for Windows (ETW)\n, by tampering settings that control the collection and flow of event telemetry.\n These settings may be stored on the system in configuration files and/or in the Registry as well as being accessible via administrative utilities such as \n or \n.\nFor example, adversaries may modify the \n value in \n to hide their malicious actions in a new or different .evtx log file. This action does not require a system reboot and takes effect immediately.\n \nETW interruption can be achieved multiple ways, however most directly by defining conditions using the \n \n cmdlet or by interfacing directly with the Registry to make alterations.\nIn the case of network-based reporting of indicators, an adversary may block traffic associated with reporting to prevent central analysis. This may be accomplished by many means, such as stopping a local process responsible for forwarding telemetry and/or creating a host-based firewall rule to block traffic to specific hosts responsible for aggregating events, such as security information and event management (SIEM) products.\nIn Linux environments, adversaries may disable or reconfigure log processing tools such as syslog or nxlog to inhibit detection and monitoring capabilities to facilitate follow on behaviors \n.\n https://attack.mitre.org/techniques/T1562/006/", "2020", 1]
[17.468338012695312, 6.974905014038086, "Cybersecurity of smart cars high on ’s agenda\nOn 13 and 14 May 2019,  welcomed representatives from ACEA – the European Automobile Manufacturers Association and CLEPA – the European Association of Automotive Suppliers expert groups on cybersecurity at its headquarters in Athens.\n\nWith the aim to strengthen relations with stakeholders from the automotive industry, automotive suppliers and manufacturers discussed with  experts about pertinent matters, including ’s ongoing work on automotive cybersecurity, the NIS Directive, the EU Cybersecurity Certification Group, and methods and practices related to securing the automotive supply chain.\nInteresting presentations and fruitful discussions took place during the two days.  aims to further foster collaboration in the area of automotive cybersecurity and will continue to engage with relevant stakeholders in order to promote cybersecurity of smart cars in Europe.\nFor more information see also:\nACEA – the European Automobile Manufacturers Association\nCLEPA – the European Association of Automotive Suppliers https://www.enisa.europa.eu/news/enisa-news/cybersecurity-of-smart-cars-high-on-enisa2019s-agenda", "2019", 0]
[13.840011596679688, 5.885433673858643, "Steal or Forge Kerberos Tickets: Silver Ticket is techniques, \n\nAdversaries who have the password hash of a target service account (e.g. SharePoint, MSSQL) may forge Kerberos ticket granting service (TGS) tickets, also known as silver tickets. Kerberos TGS tickets are also known as service tickets.\nSilver tickets are more limited in scope in than golden tickets in that they only enable adversaries to access a particular resource (e.g. MSSQL) and the system that hosts the resource; however, unlike golden tickets, adversaries with the ability to forge silver tickets are able to create TGS tickets without interacting with the Key Distribution Center (KDC), potentially making detection more difficult.\nPassword hashes for target services may be obtained using \n or \n.\n https://attack.mitre.org/techniques/T1558/002/", "2020", 1]
[13.612356185913086, 7.379907608032227, "The TellYouThePass Ransomware group has exploited a recently patched vulnerability, CVE-2024-4577, a remote code execution flaw in PHP, by deploying webshells and executing encryptor payloads on targeted systems. The attacks began on June 8th, following the release of security updates by PHP maintainers.  TellYouThePass Ransomware is known for quickly exploiting publicly disclosed vulnerabilities. In November, they exploited a remote code execution vulnerability in Apache ActiveMQ, and in December 2021, they leveraged the Log4j vulnerability to attack organizations. In the latest incidents observed by researchers at cybersecurity firm Imperva, TellYouThePass utilized the critical CVE-2024-4577 flaw to execute malicious PHP code, employing the Windows mshta.exe binary to run a malicious HTML Application (HTA) file.  The vulnerability was discovered on May 7th by Orange Tsai of Devcore, who reported it to the PHP team, and a fix was released on June 6th with the release of PHP versions 8.3.8, 8.2.20, and 8.1.29.  https://www.thaicert.or.th/2024/06/13/%e0%b8%81%e0%b8%a5%e0%b8%b8%e0%b9%88%e0%b8%a1-tellyouthepass-ransomware-%e0%b9%84%e0%b8%94%e0%b9%89%e0%b9%83%e0%b8%8a%e0%b9%89%e0%b8%9b%e0%b8%a3%e0%b8%b0%e0%b9%82%e0%b8%a2%e0%b8%8a%e0%b8%99%e0%b9%8c/", "2024", 0]
[16.710481643676758, 7.72977876663208, "Successful completion for Portugal’s European Cyber Security Month (ECSM)\nFirst reports from Portugal's European Cyber Security events show that the initiative is a success.\n\nAlmost 300 people attended the events, representing more than 75 enterprises and organisations. The second edition of InfoSec Day under the auspices of the ECSM, was hosted and organised by the “\nNational Security Office\n” in collaboration with ShadowSEC.\nJosé Torres Sobral, Director General of the “Gabinete Nacional de Segurança” of Portugal and  Management Board member, said: “I am delighted that Portugal took part in the first ever European Cyber Security Month. A very valuable joint effort that addressed real problems in theory and in practice. All events were a great opportunity to share experiences and thoughts with other leading organisations, both helpful and enjoyable. ”\nThe Agency plans to produce its ECSM's report by the end of the year.\nMore info:\nEuropean Cyber Security Month https://www.enisa.europa.eu/news/enisa-news/successful-completion-for-portugals-european-cyber-security-month-ecsm", "2012", 0]
[13.814737319946289, 6.878109931945801, "Microsoft released its March 2021 security patches, addressing 89 vulnerabilities, including 17 critical and 72 important ones.  Two 0-day vulnerabilities, already exploited in attacks and publicly disclosed, were patched. The previously disclosed Exchange server vulnerabilities are also included in this month's patches. One 0-day, CVE-2021-26411, is a memory corruption vulnerability in Internet Explorer, already exploited, allowing attackers to manipulate memory and execute malicious code. The other, CVE-2021-27077, is a privilege escalation vulnerability in Win32k.sys, enabling attackers to gain administrator privileges.  This vulnerability has been publicly disclosed but not yet exploited. Most critical vulnerabilities in this patch are Remote Code Execution (RCE) vulnerabilities, allowing remote attackers to control affected systems.  Administrators should urgently review and prioritize patching, as some vulnerabilities are actively exploited.  A list of affected products, versions, and mitigations can be found at (https://msrc.microsoft.com/update-guide/vulnerability).\n https://www.thaicert.or.th/2022/08/16/microsoft-%e0%b8%ad%e0%b8%ad%e0%b8%81%e0%b9%81%e0%b8%9e%e0%b8%95%e0%b8%8a%e0%b9%8c%e0%b8%84%e0%b8%a7%e0%b8%b2%e0%b8%a1%e0%b8%a1%e0%b8%b1%e0%b9%88%e0%b8%99%e0%b8%84%e0%b8%87%e0%b8%9b%e0%b8%a5%e0%b8%ad/", "2022", 0]
[12.707928657531738, 5.408029079437256, "Privileged Process Integrity is mitigations, \n\nProtect processes with high privileges that can be used to interact with critical system components through use of protected process light, anti-process injection defenses, or other process integrity enforcement measures.\n https://attack.mitre.org/mitigations/M1025", "2019", 1]
[11.664978981018066, 8.318073272705078, "meek is software, \n\n is an open-source Tor plugin that tunnels Tor traffic through HTTPS connections.\n https://attack.mitre.org/software/S0175", "2018", 0]
[12.262725830078125, 7.959701061248779, "Regin is software, \n\n is a malware platform that has targeted victims in a range of industries, including telecom, government, and financial institutions. Some \n timestamps date back to 2003. \n https://attack.mitre.org/software/S0019", "2017", 0]
[12.918184280395508, 5.856138229370117, "System Services: Service Execution is techniques, \n\nAdversaries may abuse the Windows service control manager to execute malicious commands or payloads. The Windows service control manager (\n) is an interface to manage and manipulate services.\n The service control manager is accessible to users via GUI components as well as system utilities such as \n and \n.\n can also be used to execute commands or payloads via a temporary Windows service created through the service control manager API.\n Tools such as \n and \n can accept remote servers as arguments and may be used to conduct remote execution.\nAdversaries may leverage these mechanisms to execute malicious content. This can be done by either executing a new or modified service. This technique is the execution used in conjunction with \n during service persistence or privilege escalation.\n https://attack.mitre.org/techniques/T1569/002/", "2020", 1]
[16.10273551940918, 5.889431476593018, "Reliance on Cookies without Validation and Integrity Checking in a Security Decision # Description : \nThe product uses a protection mechanism that relies on the existence or values of a cookie, but it does not properly ensure that the cookie is valid for the associated user.\n\n# Extend Description : \nExtended Description\nAttackers can easily modify cookies, within the browser or by implementing the client-side code outside of the browser. Attackers can bypass protection mechanisms such as authorization and authentication by modifying the cookie to contain an expected value.\n\n# Migration : \nPotential Mitigations\nPhase: Architecture and Design\nAvoid using cookie data for a security-related decision.\nPhase: Implementation\nPerform thorough input validation (i.e.: server side validation) on the cookie data if you're going to use it for a security related decision.\nPhase: Architecture and Design\nAdd integrity checks to detect tampering.\nPhase: Architecture and Design\nProtect critical cookies from replay attacks, since cross-site scripting or other attacks may allow attackers to steal a strongly-encrypted cookie that also passes integrity checks. This mitigation applies to cookies that should only be valid during a single transaction or session. By enforcing timeouts, you may limit the scope of an attack. As part of your integrity check, use an unpredictable, server-side value that is not exposed to the client.\n https://cwe.mitre.org/data/definitions/784.html", "2009", 1]
[13.750370979309082, 8.134329795837402, "Rite Aid confirms data breach after ransomware attack.  Thailand Computer Emergency Response Team (ThaiCERT) 253/67 (IT) Tuesday, July 16, 2024.  Pharmaceutical company Rite Aid has confirmed a data breach following a cyberattack in June. Rite Aid is the third largest drugstore chain in the United States, with more than 2,000 stores. The company is investigating the security breach with the assistance of external experts and will notify affected customers.  The RansomHub group has claimed responsibility for the breach and announced the theft of 10 GB of customer data, including personal information of 45 million individuals. The group also released some of the allegedly stolen data as proof of the hack and threatened to release the stolen data by July 22 if the company does not pay a ransom.  Recently, Rite Aid confirmed that the attackers gained access to the personal identifiable information of more than 24,000 customers, including names, addresses, birth dates, insurance information, and prescription data.  https://www.thaicert.or.th/2024/07/16/rite-aid-%e0%b8%a2%e0%b8%b7%e0%b8%99%e0%b8%a2%e0%b8%b1%e0%b8%99%e0%b8%81%e0%b8%b2%e0%b8%a3%e0%b8%96%e0%b8%b9%e0%b8%81%e0%b8%a5%e0%b8%b0%e0%b9%80%e0%b8%a1%e0%b8%b4%e0%b8%94%e0%b8%82%e0%b9%89%e0%b8%ad/", "2024", 0]
[17.258413314819336, 7.989180088043213, "1 month visit to  by Polish DPA members through  Da Vinci Programme\n hosted two members of the Polish Data Protection Authority , Ms.Beata Batorowicz and Ms.Dorota Sitek, throughout June. They were seconded to the Agency’s Information Security and Data Protection Unit, in ’s branch office in Athens. During their visit the guests  brought valuable  knowledge from their organisation, got involved in projects run by  and learned about new working methods and terminologies.\n\nThey said: \"Our impressions of  are very positive. We had the opportunity to have an insight into the work of the European Agency, which is key to network and information security. Taking into account that each year there is a significant increase in on-line incidents, as well as development of the new technologies that might increasingly interfere with citizens' privacy, awareness of the work of the Agency is very stimulating\".\nThe visit to  was organised as part of the  European Commission's “Leonardo da Vinci”  Lifelong Learning Programme.\nMore on the Polish DPA:\nhttp://www.giodo.gov.pl/168/j/en/\nMore on the Da Vinci Lifelong Learning Progamme:\nhttp://ec.europa.eu/education/lifelong-learning-programme/index_en.htm https://www.enisa.europa.eu/news/enisa-news/1-month-visit-to-enisa-by-polish-dpa-members-through-da-vinci-programme", "2013", 0]
[13.612091064453125, 4.337508201599121, "Endpoint Denial of Service is techniques, \n\nAdversaries may perform Endpoint Denial of Service (DoS) attacks to degrade or block the availability of services to users.\nOn Android versions prior to 7, apps can abuse Device Administrator access to reset the device lock passcode, preventing the user from unlocking the device. After Android 7, only device or profile owners (e.g. MDMs) can reset the device’s passcode.\nOn iOS devices, this technique does not work because mobile device management servers can only remove the screen lock passcode; they cannot set a new passcode. However, on jailbroken devices, malware has been discovered that can lock the user out of the device.\n https://attack.mitre.org/techniques/T1642", "2022", 1]
[13.218214988708496, 8.92429256439209, "Skygofree is software, \n\n is Android spyware that is believed to have been developed in 2014 and used through at least 2017. \n https://attack.mitre.org/software/S0327", "2018", 0]
[12.135324478149414, 5.071244239807129, "Autorun Image is techniques, \n\nAdversaries may leverage AutoRun functionality or scripts to execute malicious code. Devices configured to enable AutoRun functionality or legacy operating systems may be susceptible to abuse of these features to run malicious code stored on various forms of removeable media (i.e., USB, Disk Images [.ISO]). Commonly, AutoRun or AutoPlay are disabled in many operating systems configurations to mitigate against this technique. If a device is configured to enable AutoRun or AutoPlay, adversaries may execute code on the device by mounting the removable media to the device, either through physical or virtual means. This may be especially relevant for virtual machine environments where disk images may be dynamically mapped to a guest system on a hypervisor.  \nAn example could include an adversary gaining access to a hypervisor through the management interface to modify a virtual machine’s hardware configuration. They could then deploy an iso image with a malicious AutoRun script to cause the virtual machine to automatically execute the code contained on the disk image. This would enable the execution of malicious code within a virtual machine without needing any prior remote access to that system.\n https://attack.mitre.org/techniques/T0895", "2024", 1]
[17.70126724243164, 8.382146835327148, " celebrates EUROPE’S DAY\nN/A\n\nOn the occasion of the celebration of the 60th anniversary of the Schuman Declaration this 9th of May, the School of European Education, the Municipality of Heraklion,  and the EUROPE DIRECT Office of the Region of Crete are co-organising a European event.\nAll the children of Heraklion will have the chance to live Europe by participating in:\na Drawing Competition - “EUROPE WITH MY EYES” and a Motto Competition - “EUROPE WITH MY WORDS”.\nFor more information on Europe's day click\nhere\n: https://www.enisa.europa.eu/news/enisa-news/enisa-celebrates-europe2019s-day", "2010", 0]
[17.039339065551758, 7.0035624504089355, "Save the date –1st High Level Workshop on National Cyber Security Strategies by \n will host in Brussels the first workshop on National Cyber Security Strategies, a high level event on the cyber security status of each country, on the 27th November, 2014.\n\nParticipants include experts and high level executives from all Member States and the European Commission.\nPresentations and discussions will focus on:\nNational Cyber Security Strategies in Europe,\nCritical Information Infrastructures and\nPublic Private Partnerships.\nConfirmed speakers include:\nDavid Duren\n- Netherlands Ministry of Security and Justice,\nDaniel Bagge\n- Cyber Security / Policy Specialist at NSA CZ,\nElina Neimane\n- Latvian Ministry of Defence,\nMarc Henauer\n- Head of the operations and information center of MELANI,\nJulien Barnu\n- Strategic Advisor - Secrétariat Général de la Défense et de la Sécurité Nationale\nFurther information and event agenda:\n Cyber Security Strategies Workshop https://www.enisa.europa.eu/news/enisa-news/enisa-workshop-on-cyber-security-strategies-save-the-date", "2014", 0]
[17.887067794799805, 7.108511924743652, "Udo Helmbrecht at the Chatham House on standardising European cyber security\nN/A\n\n’s Executive Director participated at the Chatham House Cyber 2015 meeting on 'Security, Privacy and Competing interests', on the 2\nnd\nand 3\nrd\nJuly 2015, in London.\nUdo Helmbrecht gave an overview on the standards landscape and its limitations. Prof. Helmbrecht said:\n“A plethora of fora and initiatives are available which lack though a consistent strategy, at a policy and the EU funded R&D program level.\nIt is important to develop a consistent EU framework to cybersecurity standardisation. The challenge is to maintain security standards and develop a common understanding.”\n’s work in the field involves the Cybersecurity Coordination Group (CSCG) which aims towards:\n- An\nEU Governance framework\n, for a coordinated approach to cybersecurity standardisation and the identification of strategic options for EU-US standardization, addressing the particularities of cybersecurity. Furthermore, it aims to review and promote good practices.\n-\nDefining cybersecurity\nto ensure a common understanding and terminology, procedures, and identify gaps and overlaps in standardisation efforts\n- The organization of an\nEU global initiative\non cyber security standards, for the exchange of views through a high level event.\nBackground:\nIncreasing international tensions have raised cyber security risks. Governments and businesses appear increasingly in conflict over privacy and the internet governance debate has highlighted radically different national approaches to cyberspace. The conference explores the evolving relationship between cyber security, online privacy and the governance of cyberspace, and consider what policy architecture and technical capabilities are required to address critical risks and reduce international tension (source:\nChatham House\n).\nCheck out also:\n\npaper\non digital security published by European Standardisation bodies\n\nreport\non Standardisation in the field of Electronic Identities and Trust Service Providers https://www.enisa.europa.eu/news/enisa-news/udo-helmbrecht-at-the-chatham-house-on-standardising-european-cyber-security", "2015", 0]
[12.178677558898926, 4.325209617614746, "Process Injection is techniques, \n\nAdversaries may inject code into processes in order to evade process-based defenses or even elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nBoth Android and iOS have no legitimate way to achieve process injection. The only way this is possible is by abusing existing root access or exploiting a vulnerability.\n https://attack.mitre.org/techniques/T1631", "2022", 1]
[13.297379493713379, 4.193607330322266, "Rootkit is techniques, \n\nAdversaries may deploy rootkits to hide the presence of programs, files, network connections, services, drivers, and other system components. Rootkits are programs that hide the existence of malware by intercepting and modifying operating-system API calls that supply system information. Rootkits or rootkit-enabling functionality may reside at the user or kernel level in the operating system, or lower. \n   \nFirmware rootkits that affect the operating system yield nearly full control of the system. While firmware rootkits are normally developed for the main processing board, they can also be developed for the I/O that is attached to an asset. Compromise of this firmware allows the modification of all of the process variables and functions the module engages in. This may result in commands being disregarded and false information being fed to the main device. By tampering with device processes, an adversary may inhibit its expected response functions and possibly enable \n.\n https://attack.mitre.org/techniques/T0851", "2020", 1]
[12.110224723815918, 7.183257579803467, "Mythic is software, \n\n is an open source, cross-platform post-exploitation/command and control platform. \n is designed to \"plug-n-play\" with various agents and communication channels.\n Deployed \n C2 servers have been observed as part of potentially malicious infrastructure.\n https://attack.mitre.org/software/S0699", "2022", 0]
[18.043678283691406, 7.451488018035889, "Roadmap for the EU Agencies' work ahead\nPolitical leaders from the European Commission, the European Parliament and the Council of the European Union recently met in Strasbourg to take stock of the ongoing discussions on the functioning of European Agencies. They agreed on a roadmap for the work ahead. The three institutions committed to finding common ground on how to improve Agencies' work in 2011.\n\nBackground:\nIn March 2009, a dialogue on the functioning of European Agencies was launched. The three institutions then created an inter-institutional working group. This working group is the forum for a dialogue on the functioning of the EU Agencies. Its purpose is to assess the existing situation, specifically the coherence, effectiveness, accountability and transparency of Agencies' functioning.\nThis includes addressing issues such as governance, management, financial and human resources and supervision. The intra institutional group should find a common ground on how to improve agencies' work  in 2011. In their discussions since then, the institutions have identified 33 aspects which needed to be addressed. After having mapped out the factual state-of play with regard to each of these aspects, the working group will now focus on the analysis of the strengths and weaknesses of the system. Their work should now aim to identify possible solutions to problems, and ways to put them into practice.\n as an EU Agency is actively monitoring the developments in this matter.\nFor full Commission\npress release\n:\nStay tuned - subscribe to RSS feeds of  news items\nhttp://www..europa.eu/media/news-items/news-wires/RSS\nand for PRs:\nhttp://www..europa.eu/media/press-releases/press-releases/RSS https://www.enisa.europa.eu/news/enisa-news/roadmap-for-the-eu-agencies-work-ahead", "2010", 0]
[12.24415111541748, 5.975707530975342, "Command and Scripting Interpreter: PowerShell is techniques, \n\nAdversaries may abuse PowerShell commands and scripts for execution. PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system.\n Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code. Examples include the \n cmdlet which can be used to run an executable and the \n cmdlet which runs a command locally or on a remote computer (though administrator permissions are required to use PowerShell to connect to remote systems).\nPowerShell may also be used to download and run executables from the Internet, which can be executed from disk or in memory without touching disk.\nA number of PowerShell-based offensive testing tools are available, including \n,  \n, \n, and PSAttack.\nPowerShell commands/scripts can also be executed without directly invoking the \n binary through interfaces to PowerShell's underlying \n assembly DLL exposed through the .NET framework and Windows Common Language Interface (CLI).\n https://attack.mitre.org/techniques/T1059/001/", "2020", 1]
[13.306703567504883, 5.661428928375244, "Indicator Removal: Network Share Connection Removal is techniques, \n\nAdversaries may remove share connections that are no longer useful in order to clean up traces of their operation. Windows shared drive and \n connections can be removed when no longer needed. \n is an example utility that can be used to remove network share connections with the \n command. \n https://attack.mitre.org/techniques/T1070/005/", "2020", 1]
[14.51476001739502, 7.946140289306641, "C0027 is campaigns, \n\n was a financially-motivated campaign linked to \n that targeted telecommunications and business process outsourcing (BPO) companies from at least June through December of 2022. During \n \n used various forms of social engineering, performed SIM swapping, and attempted to leverage access from victim environments to mobile carrier networks.\n https://attack.mitre.org/campaigns/C0027", "2023", 0]
[17.150226593017578, 6.483330726623535, " is celebrating the Safer Internet Day 2014; New report\nN/A\n\n is an active supporter of Safer Internet Day and is inviting stakeholders to consult the dedicated page for full information on this years’ activities:\n“Let’s create a better internet together”\nNew report\nWith this occasion  is launching the report “\nBrokerage model for Network and Information Security in Education\n”.\nBy publishing the \"Brokerage model for Network & Information Security (NIS) in Education\" report, we aim to provide content and promote digital education on network and information security at all levels.\nThe report's target group is composed of educators such as trainers, teachers and peers involved in formal and non-formal education, including lifelong learning. In our current brokerage effort we try to connect the nodes in the best way possible by presenting three case studies with countries perspective, from\nThe Czech Safer Internet Centre (NCBI), ‘Strategy of community education in project — Prague safe online'\nGerman partners; The Federal Office for Information Security (BSI), ‘10th anniversary of the Safer Internet Day provides an opportunity to increase awareness’,\nNorwegian partners, ‘Norwegian Centre for Information Security’.\nHaving in focus\nFurthermore we open a discussion about hacking. ‘Hacking for good or for bad’ is a case study to advance the use of appropriate terms by the NIS in Education community, taking into account the particularity of the given ecosystem. In order to raise awareness of our target group we share the view that everybody should take part in the discussion and share the responsibility of a secure global digital community\nFor the full  report:\nBrokerage model for Network and Information Security in Education https://www.enisa.europa.eu/news/enisa-news/enisa-is-celebrating-the-safer-internet-day-2014", "2014", 0]
[13.378344535827637, 7.239925861358643, "QNAP has patched a critical zero-day vulnerability exploited in the Pwn2Own competition. Thailand Computer Emergency Response Team (ThaiCERT) 384/67 (IT) Thursday, October 31, 2024.  QNAP has released a patch for a critical security vulnerability, CVE-2024-50388, found in the company's TS-464 NAS devices. This zero-day vulnerability was exploited by hackers through the HBS 3 Hybrid Backup Sync feature, which operates within the backup system. The vulnerability allows for remote command execution if the software is not updated to the latest version. This vulnerability was revealed at Pwn2Own Ireland 2024 by the Viettel Cyber Security team from Vietnam. They successfully compromised the NAS system and gained administrator privileges, leading to the vulnerability being patched within five days of disclosure.  Users of TS-464 NAS devices should update HBS 3 Hybrid Backup Sync to version 25.1.1.673 or later.  This can be done through the QTS or QuTS hero system as an administrator.  QNAP has often been a target of ransomware groups because NAS devices store personal and important data that is vulnerable to attack. QNAP has previously warned users about ransomware attacks, such as eCh0raix and AgeLocker, which occurred in 2020 and 2021. Attackers exploited vulnerabilities in various apps like Photo Station and Multimedia Console. However, QNAP continues to release updates to address these vulnerabilities.  https://www.thaicert.or.th/2024/10/31/qnap-%e0%b9%84%e0%b8%94%e0%b9%89%e0%b9%81%e0%b8%81%e0%b9%89%e0%b9%84%e0%b8%82%e0%b8%8a%e0%b9%88%e0%b8%ad%e0%b8%87%e0%b9%82%e0%b8%ab%e0%b8%a7%e0%b9%88%e0%b8%a3%e0%b9%89%e0%b8%b2%e0%b8%a2%e0%b9%81/", "2024", 0]
[14.191180229187012, 4.034619331359863, "Defense Evasion is tactics, \n\nThe adversary is trying to avoid being detected.\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. \n https://attack.mitre.org/tactics/TA0005", "2018", 0]
[13.184589385986328, 8.449966430664062, "SocGholish is software, \n\n is a JavaScript-based loader malware that has been used since at least 2017. It has been observed in use against multiple sectors globally for initial access, primarily through drive-by-downloads masquerading as software updates. SocGholish is operated by \n and its access has been sold to groups including \n for downloading secondary RAT and ransomware payloads.\n \n https://attack.mitre.org/software/S1124", "2024", 0]
[15.102149963378906, 5.3964128494262695, "Reliance on File Name or Extension of Externally-Supplied File # Description : \nThe product allows a file to be uploaded, but it relies on the file name or extension of the file to determine the appropriate behaviors. This could be used by attackers to cause the file to be misclassified and processed in a dangerous fashion.\n\n# Extend Description : \nExtended Description\nAn application might use the file name or extension of a user-supplied file to determine the proper course of action, such as selecting the correct process to which control should be passed, deciding what data should be made available, or what resources should be allocated. If the attacker can cause the code to misclassify the supplied file, then the wrong action could occur. For example, an attacker could supply a file that ends in a \".php.gif\" extension that appears to be a GIF image, but would be processed as PHP code. In extreme cases, code execution is possible, but the attacker could also cause exhaustion of resources, denial of service, exposure of debug or system data (including application source code), or being bound to a particular server side process. This weakness may be due to a vulnerability in any of the technologies used by the web and application servers, due to misconfiguration, or resultant from another flaw in the application itself.\n\n# Migration : \nPotential Mitigations\nPhase: Architecture and Design\nMake decisions on the server side based on file content and not on file name or extension.\n https://cwe.mitre.org/data/definitions/646.html", "2008", 1]
[15.915975570678711, 8.446160316467285, "Ransomware attacks in Finland have quadrupled since joining NATO.  Thailand Computer Emergency Response Team (ThaiCERT) 370/66 (IT) on Wednesday, August 9, 2023, reports that Recorded Future News interviewed Sauli Pahlman, Deputy Director General of the National Cyber Security Center (NCSC) of Finland.  They found that targeted ransomware attacks in Finland have quadrupled since Finland joined NATO in 2023. This increase is believed to be politically motivated, as Vladimir Putin has repeatedly warned that Russia would retaliate if NATO established military infrastructure in Finland after joining the alliance. In October 2022, the Finnish Security Intelligence Service (Suojelupoliisi or SUPO) warned of increased cyberattacks from attackers linked to Russia. At that time, SUPO pointed out to NATO that membership would make the country a special target for Russia. Intelligence indicated that cyber threats to Finland's critical infrastructure had increased as a result of Russia's invasion of Ukraine. The agency also warned that these operations primarily targeted organizations and individuals from Western countries residing in Finland. ( https://www.thaicert.or.th/2023/08/11/%e0%b8%88%e0%b8%b3%e0%b8%99%e0%b8%a7%e0%b8%99%e0%b8%aa%e0%b8%96%e0%b8%b4%e0%b8%95%e0%b8%b4%e0%b8%81%e0%b8%b2%e0%b8%a3%e0%b9%82%e0%b8%88%e0%b8%a1%e0%b8%95%e0%b8%b5%e0%b8%94%e0%b9%89%e0%b8%a7%e0%b8%a2/", "2023", 0]
[13.707351684570312, 5.336462497711182, "System Network Configuration Discovery is techniques, \n\nAdversaries may look for details about the network configuration and settings, such as IP and/or MAC addresses, of systems they access or through information discovery of remote systems. Several operating system administration utilities exist that can be used to gather this information. Examples include \n, \n/\n, \n, and \n.\nAdversaries may also leverage a \n on network devices to gather information about configurations and settings, such as IP addresses of configured interfaces and static/dynamic routes (e.g. \n, \n).\nAdversaries may use the information from \n during automated discovery to shape follow-on behaviors, including determining certain access within the target network and what actions to do next. \n https://attack.mitre.org/techniques/T1016", "2017", 1]
[15.248530387878418, 8.083832740783691, "The Philippines' Department of National Defense has ordered its personnel to stop using AI-powered image-generating applications.  Thailand Computer Emergency Response Team (ThaiCERT) 459/66 (IT) Tuesday, October 24, 2023.  The Philippines' Department of National Defense warned of the risks of using AI-powered applications to create images of individuals and ordered its personnel to immediately cease using such apps.  On October 14, Defense Secretary Gilberto Teodoro Jr. issued an order to stop using AI-powered image generation applications and to exercise caution in sharing information online.  This is due to the Philippine forces' ongoing efforts to quell decades-long communist and Muslim insurgencies, and to protect its interests in the disputed South China Sea.  It is currently unclear whether the order was issued in response to a specific incident or to address potential attacks aimed at exploiting data collected by these AI-powered applications. However, the memo warns about applications used to create digital avatar profile pictures after users submit at least 10 pictures of themselves. The avatars can then mimic how users actually speak and move.  The order states that these AI-powered applications pose significant privacy and security risks, as they can be misused to create fake profiles that can lead to identity theft, social engineering, phishing attacks, and other malicious activities.  https://www.thaicert.or.th/2023/10/24/%e0%b8%81%e0%b8%a5%e0%b8%b2%e0%b9%82%e0%b8%ab%e0%b8%a1%e0%b8%82%e0%b8%ad%e0%b8%87%e0%b8%9f%e0%b8%b4%e0%b8%a5%e0%b8%b4%e0%b8%9b%e0%b8%9b%e0%b8%b4%e0%b8%99%e0%b8%aa%e0%b9%8c%e0%b8%aa%e0%b8%b1%e0%b9%88/", "2023", 0]
[14.051153182983398, 8.285346031188965, "Clorox Company, a manufacturer of cleaning products, has partially shut down systems after a cyberattack.\n\nThailand Computer Emergency Response Team (ThaiCERT) 380/66 (IT) Friday, August 18, 2023, The Clorox Company has been the victim of a cyber incident and has partially shut down systems in response to the cyber attack.  Clorox Company is a multinational consumer goods company specializing in the manufacture and marketing of household cleaning products. In response to the attack, the company has taken some systems offline while increasing security precautions. Clorox has notified law enforcement and engaged leading cybersecurity experts to investigate and determine the scope of the incident.  It is not yet clear whether the attackers stole company data. In addition, the company announced it will implement temporary workarounds, including offline operations, to continue serving customers.  The company has not yet disclosed the details of the attack, but its response to the incident suggests it may have been the victim of a ransomware attack. \n https://www.thaicert.or.th/2023/08/18/clorox-company-%e0%b8%9c%e0%b8%b9%e0%b9%89%e0%b8%9c%e0%b8%a5%e0%b8%b4%e0%b8%95%e0%b8%9c%e0%b8%a5%e0%b8%b4%e0%b8%95%e0%b8%a0%e0%b8%b1%e0%b8%93%e0%b8%91%e0%b9%8c%e0%b8%97%e0%b8%b3%e0%b8%84%e0%b8%a7/", "2023", 0]
[16.441932678222656, 6.836367607116699, "Cyber Exercise Stocktaking\n is currently taking stock of past and future national and international cyber exercises. The aim of gathering this is to create a global map of cyber exercises.\n\nPlease fill in the survey by 9th May 2012 at:\nhttp://www..europa.eu/activities/Resilience-and-CIIP/cyber-crisis-cooperation/cyber-exercise-stocktaking https://www.enisa.europa.eu/news/enisa-news/cyber-exercise-stocktaking", "2012", 0]
[12.652135848999023, 8.274500846862793, "New version of MEDUZA STEALER data theft tool launched on the DARK WEB. Thailand Computer Emergency Response Team (ThaiCERT) 5/67 (IT) Thursday, January 4, 2024.  Resecurity's HUNTER unit has detected the developers of MEDUZA STEALER, a tool used for stealing information, have launched a new version (2.2). This version has significant improvements, including support for more client software (including browser-based cryptocurrency wallets), an upgraded credit card (CC) grabber, and additional advanced operations for transferring password storage data on various platforms to extract credentials and tokens. Meduza is also a major competitor to Azorult, Redline, Racoon, and Vidar Stealer, which are used by cybercriminals for account takeover (ATO), online banking theft, and financial fraud. Those behind the development of Meduza have publicized this upgrade on various DARK WEB forums and Telegram groups. Currently, MEDUZA STEALER also supports Windows Server 2012/2016/2019/2022 and Windows 10/11.  https://www.thaicert.or.th/2024/01/04/%e0%b9%80%e0%b8%84%e0%b8%a3%e0%b8%b7%e0%b9%88%e0%b8%ad%e0%b8%87%e0%b8%a1%e0%b8%b7%e0%b8%ad%e0%b8%82%e0%b9%82%e0%b8%a1%e0%b8%a2%e0%b8%82%e0%b9%89%e0%b8%ad%e0%b8%a1%e0%b8%b9%e0%b8%a5-meduza-stealer/", "2024", 0]
[16.543235778808594, 7.196320056915283, " Workshop on EU Threat Landscape - Registration now open\nOnline registration for the first  Workshop on EU Threat Landscape is now open. The workshop will take place in Brussels on 24th February 2015.\n\nThe event aims to highlight issues with regards to the cyber threat landscape, provide ideas, and enhance communication among stakeholders. In the mid-term  expects to achieve synergies, and mobilize the community towards the accomplishment of common goals through cross fertilization of ideas.\nThe main topics of the workshop include:\n Work on Threat Landscape: Top Threats and Threat Trends\nThematic Threat Landscapes: Assets, Threats, Good Practices\nThreat Intelligence: practices from information collection organisations\nThreat Intelligence: usage practices and user requirements\nRound table: The future of Threat Landscape\nFor more information and the draft agenda:\n Workshop on EU Threat Landscape https://www.enisa.europa.eu/news/enisa-news/enisa-workshop-on-eu-threat-landscape-registration-now-open", "2015", 0]
[17.231321334838867, 5.953310489654541, "1st Future Internet Summit Report\nThe Exceutive Director of  chaired the keynote session at the Future Internet Summit in Luxembourg.\n\nThe Executive Director of  Dr Udo Helmbrecht moderated the keynote session of the very First European\nSummit on the Future Internet\n, which took place on June 2-3, in Luxembourg.\nThe Agency has recently written a scenario report on the Future Internet/Internet of Things in\n'Flying 2.0'\n. This is part of the Agency's work on following Emerging Future Risks.\nOrganisational background:\nThe Interdisciplinary Center for Security, Reliability and Trust\nof the University of Luxembourg intends to play a leading role in the research that will be carried out on the Future of the Internet.\nStay tuned - subscribe to RSS feeds of  news items\nhttp://www..europa.eu/media/news-items/news-wires/RSS\nand for PRs:\nhttp://www..europa.eu/media/press-releases/press-releases/RSS https://www.enisa.europa.eu/news/enisa-news/future-internet-summit-report", "2010", 0]
[14.215744018554688, 6.4479193687438965, "Email Collection: Local Email Collection is techniques, \n\nAdversaries may target user email on local systems to collect sensitive information. Files containing email data can be acquired from a user’s local system, such as Outlook storage or cache files.\nOutlook stores data locally in offline data files with an extension of .ost. Outlook 2010 and later supports .ost file sizes up to 50GB, while earlier versions of Outlook support up to 20GB.\n IMAP accounts in Outlook 2013 (and earlier) and POP accounts use Outlook Data Files (.pst) as opposed to .ost, whereas IMAP accounts in Outlook 2016 (and later) use .ost files. Both types of Outlook data files are typically stored in \n or \n.\n https://attack.mitre.org/techniques/T1114/001/", "2020", 1]
[15.76149845123291, 7.1359663009643555, "New video clip; Smartphones security risks & opportunities\nSupporting the newly launched report, the Agency has produced a video clip on Smartphone security; risk opportunities & recommendations, outlining the report.\n\n'Security, is there an app for that'?\nThe\nnewly launched  report\nidentifies the top security risks and opportunities of smartphone use and  gives practical security advice for businesses, consumers and governments. Top risks include  spyware, poor data cleansing when recycling phones, accidental data leakage, and unauthorised premium-rate phonecalls and SMSs.\nThis is in brief explained in the\nvideo clip\non the same topic.\nStay updated - subscribe to RSS feeds of  news items & press releases!\nNews items;\nhttp://www..europa.eu/media/news-items/news-wires/RSS\nPRs:\nhttp://www..europa.eu/media/press-releases/press-releases/RSS https://www.enisa.europa.eu/news/enisa-news/new-video-smartphones-security-risks-and-opportunities", "2010", 0]
[12.821867942810059, 4.022464752197266, "Audio Capture is techniques, \n\nAn adversary can leverage a computer's peripheral devices (e.g., microphones and webcams) or applications (e.g., voice and video call services) to capture audio recordings for the purpose of listening into sensitive conversations to gather information.\nMalware or scripts may be used to interact with the devices through an available API provided by the operating system or an application to capture audio. Audio files may be written to disk and exfiltrated later.\n https://attack.mitre.org/techniques/T1123", "2017", 1]
[14.652141571044922, 8.670365333557129, "Lumen blocked the hacker group Salt Typhoon from its network after discovering they were targeting attacks in the US and globally.  Thailand Computer Emergency Response Team (ThaiCERT) 04/67 (IT) on Friday, January 3, 2025, reported that Lumen successfully blocked the hacker group Salt Typhoon, linked to China, from its network.  They confirmed that no customer data was accessed or leaked.  Salt Typhoon, also known as FamousSparrow and GhostEmperor, has been active since 2019, targeting government agencies and telecommunications companies worldwide.  Recently, they infiltrated nine US telecommunications companies as part of a cyber espionage campaign.  Anne Neuberger, the White House cybersecurity advisor, revealed that the attacks focused on Americans' metadata, including communications of key figures in government and politics.  In early December 2024, it was reported that Salt Typhoon had penetrated telecommunications companies in dozens of countries. The Wall Street Journal further reported that at least eight US telecommunications companies were previously affected.  In addition to Lumen, major providers such as AT&T and Verizon confirmed they successfully strengthened network security and prevented attacks.  Meanwhile, T-Mobile stated that the hackers attempted to penetrate their systems but were unable to access sensitive data or company systems. This incident highlights the importance of cybersecurity measures in the telecommunications sector, which plays a crucial role in national security.   https://www.thaicert.or.th/2025/01/03/lumen-%e0%b8%9b%e0%b8%b4%e0%b8%94%e0%b8%81%e0%b8%b1%e0%b9%89%e0%b8%99%e0%b8%81%e0%b8%a5%e0%b8%b8%e0%b9%88%e0%b8%a1%e0%b9%81%e0%b8%ae%e0%b8%81%e0%b9%80%e0%b8%81%e0%b8%ad%e0%b8%a3%e0%b9%8c-salt-typhoon/", "2025", 0]
[12.58569049835205, 4.63618803024292, "Manipulate I/O Image is techniques, \n\nAdversaries may manipulate the I/O image of PLCs through various means to prevent them from functioning as expected. Methods of I/O image manipulation may include overriding the I/O table via direct memory manipulation or using the override function used for testing PLC programs. \n During the scan cycle, a PLC reads the status of all inputs and stores them in an image table. \n The image table is the PLCs internal storage location where values of inputs/outputs for one scan are stored while it executes the user program. After the PLC has solved the entire logic program, it updates the output image table. The contents of this output image table are written to the corresponding output points in I/O Modules. \nOne of the unique characteristics of PLCs is their ability to override the status of a physical discrete input or to override the logic driving a physical output coil and force the output to a desired status.\n https://attack.mitre.org/techniques/T0835", "2020", 1]
[14.580041885375977, 6.195972919464111, "Account Manipulation: Additional Cloud Roles is techniques, \n\nAn adversary may add additional roles or permissions to an adversary-controlled cloud account to maintain persistent access to a tenant. For example, adversaries may update IAM policies in cloud-based environments or add a new global administrator in Office 365 environments.\n With sufficient permissions, a compromised account can gain almost unlimited access to data and settings (including the ability to reset the passwords of other admins).\n \nThis account modification may immediately follow \n or other malicious account activity. Adversaries may also modify existing \n that they have compromised. This could lead to privilege escalation, particularly if the roles added allow for lateral movement to additional accounts.\nFor example, in AWS environments, an adversary with appropriate permissions may be able to use the \n API to define a new version of an IAM policy or the \n API to attach an IAM policy with additional or distinct permissions to a compromised user account.\nIn some cases, adversaries may add roles to adversary-controlled accounts outside the victim cloud tenant. This allows these external accounts to perform actions inside the victim tenant without requiring the adversary to \n or modify a victim-owned account.\n https://attack.mitre.org/techniques/T1098/003/", "2020", 1]
[12.818169593811035, 9.291889190673828, "ViceLeaker is software, \n\n is a spyware framework, capable of extensive surveillance and data exfiltration operations, primarily targeting devices belonging to Israeli citizens.\n https://attack.mitre.org/software/S0418", "2019", 0]
[14.322525978088379, 4.118000507354736, "Weaken Encryption: Reduce Key Space is techniques, \n\nAdversaries may reduce the level of effort required to decrypt data transmitted over the network by reducing the cipher strength of encrypted communications.\nAdversaries can weaken the encryption software on a compromised network device by reducing the key size used by the software to convert plaintext to ciphertext (e.g., from hundreds or thousands of bytes to just a couple of bytes). As a result, adversaries dramatically reduce the amount of effort needed to decrypt the protected information without the key.\nAdversaries may modify the key size used and other encryption parameters using specialized commands in a \n introduced to the system through \n to change the configuration of the device. \n https://attack.mitre.org/techniques/T1600/001/", "2020", 1]
[13.814166069030762, 8.964436531066895, "Moonstone Sleet is groups, \n\n is a North Korean-linked threat actor executing both financially motivated attacks and espionage operations. The group previously overlapped significantly with another North Korean-linked entity, \n, but has differentiated its tradecraft since 2023. \n is notable for creating fake companies and personas to interact with victim entities, as well as developing unique malware such as a variant delivered via a fully functioning game.\n https://attack.mitre.org/groups/G1036", "2024", 0]
[12.044014930725098, 6.38575553894043, "POWRUNER is software, \n\n is a PowerShell script that sends and receives commands to and from the C2 server. \n https://attack.mitre.org/software/S0184", "2018", 0]
[11.650306701660156, 6.931519508361816, "Ferocious is software, \n\n is a first stage implant composed of VBS and PowerShell scripts that has been used by \n since at least 2021.\n https://attack.mitre.org/software/S0679", "2022", 0]
[12.290385246276855, 8.714777946472168, "RedLeaves is software, \n\n is a malware family used by \n. The code overlaps with \n and may be based upon the open source tool Trochilus. \n \n https://attack.mitre.org/software/S0153", "2017", 0]
[16.5294189453125, 8.287691116333008, "New language versions of key documents\nThe Work Programme 2010 is now available in German and French. Moreover, the Computer Emergency Response Team -CERTs- exercise material is online in Spanish.\n\nThe  Work Programme 2010 is now available in\nGerman (DE)\nand\nFrench (FR).\nThe Computer Emergeny Response Team [CERTs]\nExercise material\nhas also become available in Spanish, i.e. the CERTs exercise\nhandbook\nand\ntoolset\n, by kind translation of\nINTECO-CERT\n.\nStay tuned - subscribe to RSS feeds of  news items\nhttp://www..europa.eu/media/news-items/news-wires/RSS https://www.enisa.europa.eu/news/enisa-news/new-language-versions-of-key-documents", "2010", 0]
[14.921629905700684, 4.702187538146973, "Stage Capabilities: SEO Poisoning is techniques, \n\nAdversaries may poison mechanisms that influence search engine optimization (SEO) to further lure staged capabilities towards potential victims. Search engines typically display results to users based on purchased ads as well as the site’s ranking/score/reputation calculated by their web crawlers and algorithms.\nTo help facilitate \n, adversaries may stage content that explicitly manipulates SEO rankings in order to promote sites hosting their malicious payloads (such as \n) within search engines. Poisoning SEO rankings may involve various tricks, such as stuffing keywords (including in the form of hidden text) into compromised sites. These keywords could be related to the interests/browsing habits of the intended victim(s) as well as more broad, seasonably popular topics (e.g. elections, trending news).\nIn addition to internet search engines (such as Google), adversaries may also aim to manipulate specific in-site searches for developer platforms (such as GitHub) to deceive users towards \n lures. In-site searches will rank search results according to their own algorithms and metrics such as popularity\n which may be targeted and gamed by malicious actors.\nAdversaries may also purchase or plant incoming links to staged capabilities in order to boost the site’s calculated relevance and reputation.\nSEO poisoning may also be combined with evasive redirects and other cloaking mechanisms (such as measuring mouse movements or serving content based on browser user agents, user language/localization settings, or HTTP headers) in order to feed SEO inputs while avoiding scrutiny from defenders.\n https://attack.mitre.org/techniques/T1608/006/", "2022", 1]
[16.229450225830078, 6.256394863128662, "SecureCloud 2010 agenda announced\nSecureCloud 2010 is the first European event to focus specifically on state-of-the-art practices designed to promote security, privacy, and trust in cloud computing. The SecureCloud 2010 conference agenda has now been announced, to be held March 16 – 17 in Barcelona, Spain.\n\nAmong the keynote speeches are Dr. Udo Helmbrecht, Executive Director of  and Pamela Jones Harbour, Commissioner of the US Federal Trade Commission.\nSecureCloud 2010 workshops will include sessions and panels that tackle a broad array of immediate cloud security issues.\nSecurity and Data Protection in the Cloud\n• MobileCloud Security\n• Government Uses of Cloud Security\n• Fighting Fraud in the Cloud\n• Cloud Service Certification and Assurance\nThe complete conference agenda can be found at:\nhttp://www.cloudsecurityalliance.org/sc2010.html\nThe event is free, but space is limited, so participants are encouraged to register early:\nhttp://securecloud2010.eventbrite.com/\n“Cloud computing presents its own unique security risks and threats that we’re still in the process of understanding,” Dr. Udo Helmbrecht, Executive Director of  commented. “\nThe conference is hosted by the Cloud Security Alliance (CSA), European Network and Information Security Agency (), the IEEE Standards Association, and ISACA, four of the organizations shaping the future of Cloud Computing Security. https://www.enisa.europa.eu/news/enisa-news/secure-cloud-agenda-announced", "2010", 0]
[15.30128288269043, 6.569744110107422, "Security Logging and Monitoring Failures Security logging and monitoring came from the Top 10 community survey (#3), up\nslightly from the tenth position in the OWASP Top 10 2017. Logging and\nmonitoring can be challenging to test, often involving interviews or\nasking if attacks were detected during a penetration test. There isn't\nmuch CVE/CVSS data for this category, but detecting and responding to\nbreaches is critical. Still, it can be very impactful for accountability, visibility,\nincident alerting, and forensics. This category expands beyond  CWE-778\nInsufficient Logging  to include  CWE-117 Improper Output Neutralization\nfor Logs ,  CWE-223 Omission of Security-relevant Information , and\n CWE-532   Insertion of Sensitive Information into Log File .\nReturning to the OWASP Top 10 2021, this category is to help detect,\nescalate, and respond to active breaches. Without logging and\nmonitoring, breaches cannot be detected. Insufficient logging,\ndetection, monitoring, and active response occurs any time: https://owasp.org/Top10/A09_2021-Security_Logging_and_Monitoring_Failures/", "2021", 1]
[13.033976554870605, 8.305462837219238, "Chinoxy is software, \n\n is a backdoor that has been used since at least November 2018, during the \n campaign, to gain persistence and drop additional payloads. According to security researchers, \n has been used by Chinese-speaking threat actors.\n https://attack.mitre.org/software/S1041", "2022", 0]
[17.91543197631836, 7.52617073059082, "EGFI Members visit \nOn Friday the 22nd of April, the Expert Group in Finance (EGFI), which consists of security experts from different EU Member States, visited the  premises in Athens.\n\nFurthermore the meeting was attended remotely by a representative of the EC and an expert in block chain technology.\nThe meeting aimed to provide valuable insights into the current status and potential ways to address concerns and risks in the finance sector regarding emerging topics such as block chain, mobile payments etc. A series of topics was presented and an open discussion was held on the following:\nNIS directive\nThird party payments as stated in Payment Services Directive 2 (PSD2)\nBlock chain technology for Financial Institutions\nMobile payments\nCyber Insurance\nCloud developments https://www.enisa.europa.eu/news/enisa-news/egfi-members-visit-enisa", "2016", 0]
[16.06682014465332, 7.679693222045898, "Policy Statement on Botnets\nAgency Position Statement on European anti-botnet policy.\n\nBotnets are networks of ordinary computers, silently hijacked by criminal organisations. They are the cyber-criminal's weapon of choice for serious attacks threatening Europe's economy and the privacy of its citizens.\nThe Agency's recent statement identifies;\n-what is being done in the fight against botnets;\n-what options are available for European governments;\n-who is responsible for fighting botnets;\n-what are the incentives for fighting botnets, underlining the need for a systematic approach, at all levels (local, national, EU and at global level.)\nPlease read the full\nAgency Position Statement\non European anti-botnet policy, submitted to the Hungarian EU-Presidency Telecommunications Ministerial conference in Budapest on 15 April 2011. https://www.enisa.europa.eu/news/enisa-news/policy-statement-on-botnets", "2011", 0]
[12.580301284790039, 7.9175028800964355, "Rclone is software, \n\n is a command line program for syncing files with cloud storage services such as Dropbox, Google Drive, Amazon S3, and MEGA. \n has been used in a number of ransomware campaigns, including those associated with the \n and DarkSide Ransomware-as-a-Service operations.\n https://attack.mitre.org/software/S1040", "2022", 0]
[13.04731273651123, 3.655709981918335, "Exfiltration Over Physical Medium: Exfiltration over USB is techniques, \n\nAdversaries may attempt to exfiltrate data over a USB connected physical device. In certain circumstances, such as an air-gapped network compromise, exfiltration could occur via a USB device introduced by a user. The USB device could be used as the final exfiltration point or to hop between otherwise disconnected systems.\n https://attack.mitre.org/techniques/T1052/001/", "2020", 1]
[12.07215404510498, 7.81918478012085, "Akira is groups, \n\n is a ransomware variant and ransomware deployment entity active since at least March 2023.\n \n uses compromised credentials to access single-factor external access mechanisms such as VPNs for initial access, then various publicly-available tools and techniques for lateral movement.\n \n operations are associated with \"double extortion\" ransomware activity, where data is exfiltrated from victim environments prior to encryption, with threats to publish files if a ransom is not paid. Technical analysis of \n ransomware indicates multiple overlaps with and similarities to \n malware.\n https://attack.mitre.org/groups/G1024", "2024", 0]
[14.322966575622559, 3.855590343475342, "Impact is tactics, \n\nThe adversary is trying to manipulate, interrupt, or destroy your devices and data.\nThe impact tactic consists of techniques used by the adversary to execute his or her mission objectives but that do not cleanly fit into another category such as Collection. Mission objectives vary based on each adversary's goals, but examples include toll fraud, destruction of device data, or locking the user out of his or her device until a ransom is paid.\n https://attack.mitre.org/tactics/TA0034", "2018", 0]
[16.696897506713867, 6.050908088684082, "ISSE 2013: Call for Contributions\nISSE 2013: Call for Contributions: Submissions accepted until April 30th.\n\n is once again taking part in the annual \"Information Security Solutions Europe Conference (\nISSE\n)\" (22nd & 23rd October 2013, Brussels). The Agency will present updates on its latest work, and developments in the world of cyber security.\nThe event organisers are keen to hear from anyone who may wish to make presentations at ISSE. For details of their call for papers, and general information on ISSE, see the links below.\nHow to submit:\nhttp://www.teletrust.de/uploads/media/ISSE_2013_EEMA_TeleTrusT__CfC.pdf\nFor full information re the ISSE:\nhttp://www.isse.eu.com/\nISSE 2013 will also be part of the European Cyber Security Month 2013 activities. https://www.enisa.europa.eu/news/enisa-news/isse-2013-call-for-contributions", "2013", 0]
[14.453174591064453, 9.019460678100586, "Putter Panda is groups, \n\n is a Chinese threat group that has been attributed to Unit 61486 of the 12th Bureau of the PLA’s 3rd General Staff Department (GSD). \n https://attack.mitre.org/groups/G0024", "2017", 0]
